브레인스토밍 https://labs.msaez.io/#/courses/cna-full/be513ff0-e2d5-11ec-b71d-f90e603c5333/capstone-team/alphamega89@naver.com


5.로그인 (원장분리)


기능적 요구사항

1.아이디/패스워드 기반으로 로그인한다.
2. 정상 고객인지 확인한다. 
3. 아이디와 패스워드  일치하는지 확인한다. 
4. 해당 고객의 계좌와 잔액을 불러온다. 
5. 로그인이 완료된다. 
6. 자신의 계좌와 잔액 정보를 확인할 수 있다. 



비기능적 요구사항
1. 트랜잭션
- 회원상태가 정상인 경우에 로그인 할 수있다. 
- 아이디/비밀번호가 일치하는 경우에 로그인 할 수 있다. 


2. 장애격리

상품 및 수신 서비스가 장애이더라도, 로그인은 정상적으로 되어야한다.(365일 24시간 받을 수 있어야 한다(상품처리서비스가 죽더라도,,)

성능

상품서비스가 불안정 하더라도 손님은 자신의 계좌와 최근 잔액 상태를 조회할 수있어한다. 





1. Fork (내 저장소로 환경 복제)
이 Repo 를 먼저 Fork 합니다. github 의 우상단 Fork를 클릭

1. 본인의 레포지토리를 확인
e.g. github.com/내계정/capstone-project-base

1. Gitpod 로 접속
본인의 레포지토리 주소 앞에 "gitpod.io/#" 을 넣고 접속 
